#### Terraform Plan ❌
```
module.talos.talos_image_factory_schematic.this: Refreshing state... [id=d4cf8602b9d285ede53209d5e8c482372d61d3b9aa850736c2dc65bd8d091cba]
module.talos.talos_machine_secrets.machine_secrets: Refreshing state... [id=machine_secrets]
module.talos.data.talos_image_factory_urls.this: Reading...
module.talos.data.talos_image_factory_urls.this: Read complete after 0s
module.proxmox.proxmox_virtual_environment_download_file.talos_nocloud_image: Refreshing state... [id=local:iso/talos-v1.11.5-nocloud-amd64.img]
module.talos.data.talos_machine_configuration.machineconfig_cp: Reading...
module.talos.data.talos_client_configuration.talosconfig: Reading...
module.talos.data.talos_client_configuration.talosconfig: Read complete after 0s [id=cluster01]
module.talos.data.talos_machine_configuration.machineconfig_worker: Reading...
module.talos.data.talos_machine_configuration.machineconfig_cp: Read complete after 0s [id=cluster01]
module.talos.data.talos_machine_configuration.machineconfig_worker: Read complete after 0s [id=cluster01]
module.proxmox.proxmox_virtual_environment_vm.talos_cp["talos-cp-01"]: Refreshing state... [id=101]
module.proxmox.proxmox_virtual_environment_vm.talos_workers["talos-worker-01"]: Refreshing state... [id=102]
module.talos.talos_machine_configuration_apply.worker_config_apply[0]: Refreshing state... [id=machine_configuration_apply]
module.talos.talos_machine_configuration_apply.cp_config_apply[0]: Refreshing state... [id=machine_configuration_apply]
module.talos.talos_machine_bootstrap.bootstrap: Refreshing state... [id=machine_bootstrap]
module.talos.talos_cluster_kubeconfig.kubeconfig: Refreshing state... [id=cluster01]
module.proxmox_csi_plugin.proxmox_virtual_environment_role.csi: Refreshing state... [id=CSI]
module.traefik.random_password.ubuntu_container_password: Refreshing state... [id=none]
module.traefik.proxmox_virtual_environment_download_file.latest_ubuntu_20_focal_lxc_img: Refreshing state... [id=local:vztmpl/ubuntu-20.04-standard_20.04-1_amd64.tar.gz]
module.traefik.tls_private_key.ubuntu_container_key: Refreshing state... [id=0940bdcfb1f2130a3129ccae2ec89db43fb78626]
module.proxmox_csi_plugin.proxmox_virtual_environment_user.kubernetes-csi: Refreshing state... [id=kubernetes-csi@pve]
module.proxmox_csi_plugin.helm_release.proxmox_csi_plugin: Refreshing state... [id=proxmox-csi-plugin]
module.sealed-secrets.helm_release.sealed_secrets: Refreshing state... [id=sealed-secrets-controller]
module.monitoring.kubernetes_namespace.monitoring: Refreshing state... [id=monitoring]
module.sealed-secrets.kubernetes_namespace.sealed-secrets: Refreshing state... [id=sealed-secrets]
module.proxmox_csi_plugin.kubernetes_namespace.csi-proxmox: Refreshing state... [id=csi-proxmox]
module.traefik.proxmox_virtual_environment_container.traefik: Refreshing state... [id=108]
module.sealed-secrets.kubernetes_secret.sealed-secrets-key: Refreshing state... [id=sealed-secrets/sealed-secrets-bootstrap-key]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.proxmox.proxmox_virtual_environment_download_file.talos_nocloud_image has been deleted
  - resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      - id                      = "local:iso/talos-v1.11.5-nocloud-amd64.img" -> null
        # (11 unchanged attributes hidden)
    }

  # module.proxmox.proxmox_virtual_environment_vm.talos_cp["talos-cp-01"] has been deleted
  - resource "proxmox_virtual_environment_vm" "talos_cp" {
      - id                                   = "101" -> null
        name                                 = "talos-cp-01"
        tags                                 = [
            "terraform",
        ]
        # (33 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.proxmox.proxmox_virtual_environment_vm.talos_workers["talos-worker-01"] has been deleted
  - resource "proxmox_virtual_environment_vm" "talos_workers" {
      - id                                   = "102" -> null
        name                                 = "talos-worker-01"
        tags                                 = [
            "terraform",
        ]
        # (33 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.proxmox.proxmox_virtual_environment_download_file.talos_nocloud_image will be created
  + resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      + content_type            = "iso"
      + datastore_id            = "local"
      + decompression_algorithm = "gz"
      + file_name               = "talos-v1.11.5-nocloud-amd64.img"
      + id                      = (known after apply)
      + node_name               = "pve01"
      + overwrite               = false
      + overwrite_unmanaged     = false
      + size                    = (known after apply)
      + upload_timeout          = 600
      + url                     = "https://factory.talos.dev/image/d4cf8602b9d285ede53209d5e8c482372d61d3b9aa850736c2dc65bd8d091cba/v1.11.5/nocloud-amd64.raw.gz"
      + verify                  = true
    }

  # module.proxmox.proxmox_virtual_environment_vm.talos_cp["talos-cp-01"] will be created
  + resource "proxmox_virtual_environment_vm" "talos_cp" {
      + acpi                                 = true
      + bios                                 = "seabios"
      + delete_unreferenced_disks_on_destroy = true
      + description                          = "Managed by Terraform"
      + id                                   = (known after apply)
      + ipv4_addresses                       = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + keyboard_layout                      = "en-us"
      + mac_addresses                        = (known after apply)
      + migrate                              = false
      + name                                 = "talos-cp-01"
      + network_interface_names              = (known after apply)
      + node_name                            = "pve01"
      + on_boot                              = true
      + protection                           = false
      + purge_on_destroy                     = true
      + reboot                               = false
      + reboot_after_update                  = true
      + scsi_hardware                        = "virtio-scsi-pci"
      + started                              = true
      + stop_on_destroy                      = false
      + tablet_device                        = true
      + tags                                 = [
          + "terraform",
        ]
      + template                             = false
      + timeout_clone                        = 1800
      + timeout_create                       = 1800
      + timeout_migrate                      = 1800
      + timeout_move_disk                    = 1800
      + timeout_reboot                       = 1800
      + timeout_shutdown_vm                  = 1800
      + timeout_start_vm                     = 1800
      + timeout_stop_vm                      = 300
      + vm_id                                = (known after apply)

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + cores      = 2
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v2-AES"
          + units      = 100
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + file_id           = (known after apply)
          + interface         = "virtio0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 40
          + ssd               = false
        }

      + initialization {
          + datastore_id         = "local-lvm"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "192.168.1.210/24"
                  + gateway = "192.168.1.1"
                }
              + ipv6 {
                  + address = "dhcp"
                }
            }
        }

      + memory {
          + dedicated      = 8192
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

  # module.proxmox.proxmox_virtual_environment_vm.talos_workers["talos-worker-01"] will be created
  + resource "proxmox_virtual_environment_vm" "talos_workers" {
      + acpi                                 = true
      + bios                                 = "seabios"
      + delete_unreferenced_disks_on_destroy = true
      + description                          = "Managed by Terraform"
      + id                                   = (known after apply)
      + ipv4_addresses                       = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + keyboard_layout                      = "en-us"
      + mac_addresses                        = (known after apply)
      + migrate                              = false
      + name                                 = "talos-worker-01"
      + network_interface_names              = (known after apply)
      + node_name                            = "pve01"
      + on_boot                              = true
      + protection                           = false
      + purge_on_destroy                     = true
      + reboot                               = false
      + reboot_after_update                  = true
      + scsi_hardware                        = "virtio-scsi-pci"
      + started                              = true
      + stop_on_destroy                      = false
      + tablet_device                        = true
      + tags                                 = [
          + "terraform",
        ]
      + template                             = false
      + timeout_clone                        = 1800
      + timeout_create                       = 1800
      + timeout_migrate                      = 1800
      + timeout_move_disk                    = 1800
      + timeout_reboot                       = 1800
      + timeout_shutdown_vm                  = 1800
      + timeout_start_vm                     = 1800
      + timeout_stop_vm                      = 300
      + vm_id                                = (known after apply)

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + cores      = 4
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v2-AES"
          + units      = 100
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + file_id           = (known after apply)
          + interface         = "virtio0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 40
          + ssd               = false
        }

      + initialization {
          + datastore_id         = "local-lvm"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "192.168.1.211/24"
                  + gateway = "192.168.1.1"
                }
              + ipv6 {
                  + address = "dhcp"
                }
            }
        }

      + memory {
          + dedicated      = 8192
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

  # module.sealed-secrets.kubernetes_secret.sealed-secrets-key will be updated in-place
  ~ resource "kubernetes_secret" "sealed-secrets-key" {
      ~ data                           = (sensitive value)
        id                             = "sealed-secrets/sealed-secrets-bootstrap-key"
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.talos.data.talos_cluster_health.health will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "talos_cluster_health" "health" {
      + client_configuration = {
          + ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQakNCOGFBREFnRUNBaEJKRXY5aWVSbWtTVWlwejU1aUpJOXBNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5URXhNekF5TURVd01qUmFGdzB6TlRFeE1qZ3lNRFV3TWpSYU1CQXhEakFNQmdOVgpCQW9UQlhSaGJHOXpNQ293QlFZREsyVndBeUVBbDk1YnFvTlBQTnJIYlpWOXVqVmN6REVZelBaNG5BQU1tT1JFCmVvUGF5RTZqWVRCZk1BNEdBMVVkRHdFQi93UUVBd0lDaERBZEJnTlZIU1VFRmpBVUJnZ3JCZ0VGQlFjREFRWUkKS3dZQkJRVUhBd0l3RHdZRFZSMFRBUUgvQkFVd0F3RUIvekFkQmdOVkhRNEVGZ1FVbUFhLzN0bm8rejBRQVRDKwo5NGRKUCt0cXRNZ3dCUVlESzJWd0EwRUFLeEltQTlHY05uQnJaaEUvTVhrVjAzTWJ1Zkx4ZFJrZkpUbVF0RkVyCkFhcEhPVDZ2MjV1TzllQzBjQWk0VWZvbHVyOCtnUHdWOTN4QnFPK0RvL1JQQWc9PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
          + client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJoeHBlMkxHc0Uwc1FBVjhKZ0c3UktNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5URXhNekF5TURVd01qUmFGdzB5TmpFeE16QXlNRFV3TWpSYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQTk2c0tlb0dqbVRqck42eUh3SStSSjBUK3JOV1R2TnFpCkJKa2VjNWlKNzZLalNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCU1lCci9lMmVqN1BSQUJNTDczaDBrLzYycTB5REFGQmdNclpYQURRUUJacVNGRwpsOUt1M1g0bzVOeEdRRFNvL0EvWWsrS0lKKzkra2VjSitna3UrTzNvLzdPbk4xM2l5cWdEM0JLN081dDhGWHJICmVEMjZpQ3VZbnY3bE5pWUcKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
          + client_key         = (sensitive value)
        }
      + control_plane_nodes  = [
          + "192.168.1.210",
        ]
      + endpoints            = [
          + "192.168.1.210",
        ]
      + id                   = (known after apply)
      + timeouts             = {
          + read = "10m"
        }
      + worker_nodes         = [
          + "192.168.1.211",
        ]
    }

  # module.talos.talos_machine_configuration_apply.cp_config_apply[0] will be updated in-place
  ~ resource "talos_machine_configuration_apply" "cp_config_apply" {
      ~ config_patches              = [
          ~ <<-EOT
                machine:
                  network:
                    hostname: talos-cp-01
                    nameservers:
              +       # Use cluster CoreDNS for DNS resolution
              +       - 10.96.0.10
                      - 1.1.1.1
                      - 8.8.8.8
                  features:
                    hostDNS:
                      enabled: false
                  kubelet:
                      extraArgs:
                        rotate-server-certificates: true
                  nodeLabels:
                    topology.kubernetes.io/region: cluster01
                    topology.kubernetes.io/zone: pve01
                
                cluster:
                  allowSchedulingOnControlPlanes: true
                  network:
                    cni:
                      name: none
                  proxy:
                    disabled: true
                  extraManifests:
                    - https://raw.githubusercontent.com/alex1989hu/kubelet-serving-cert-approver/main/deploy/standalone-install.yaml
                    - https://github.com/kubernetes-sigs/metrics-server/releases/latest/download/components.yaml
                  inlineManifests:
                  - name: cilium-values
                    contents: |
                      ---
                      apiVersion: v1
                      kind: ConfigMap
                      metadata:
                        name: cilium-values
                        namespace: kube-system
                      data:
                        values.yaml: |-
                          cluster:
                            name: cluster01
                            id: 1
                          
                          kubeProxyReplacement: true
                          
                          # Talos specific
                          k8sServiceHost: localhost
                          k8sServicePort: 7445
                          securityContext:
                            capabilities:
                              ciliumAgent: [ CHOWN, KILL, NET_ADMIN, NET_RAW, IPC_LOCK, SYS_ADMIN, SYS_RESOURCE, DAC_OVERRIDE, FOWNER, SETGID, SETUID ]
                              cleanCiliumState: [ NET_ADMIN, SYS_ADMIN, SYS_RESOURCE ]
                          
                          cgroup:
                            autoMount:
                              enabled: false
                            hostRoot: /sys/fs/cgroup
                          
                          # https://docs.cilium.io/en/stable/network/concepts/ipam/
                          ipam:
                            mode: kubernetes
                          
                          operator:
                            rollOutPods: true
                            resources:
                              limits:
                                cpu: 500m
                                memory: 256Mi
                              requests:
                                cpu: 50m
                                memory: 128Mi
                          
                          # Roll out cilium agent pods automatically when ConfigMap is updated.
                          rollOutCiliumPods: true
                          resources:
                            limits:
                              cpu: 1000m
                              memory: 1Gi
                            requests:
                              cpu: 200m
                              memory: 512Mi
                          
                          #debug:
                          #  enabled: true
                          
                          # Increase rate limit when doing L2 announcements
                          k8sClientRateLimit:
                            qps: 20
                            burst: 100
                          
                          l2announcements:
                            enabled: true
                          
                          externalIPs:
                            enabled: true
                          
                          ciliumEndpointSlice:
                            enabled: true
                          
                          loadBalancer:
                            # https://docs.cilium.io/en/stable/network/kubernetes/kubeproxy-free/#maglev-consistent-hashing
                            algorithm: maglev
                          
                          gatewayAPI:
                            enabled: true
                          envoy:
                            securityContext:
                              capabilities:
                                keepCapNetBindService: true
                                envoy: [ NET_ADMIN, PERFMON, BPF ]
                          
                          hubble:
                            enabled: true
                            relay:
                              enabled: true
                              rollOutPods: true
                            ui:
                              enabled: true
                              rollOutPods: true
                          
                          ingressController:
                            enabled: false
                            default: true
                            loadbalancerMode: shared
                            service:
                              annotations:
                                io.cilium/lb-ipam-ips: 192.168.1.223
                          
                          # mTLS
                          authentication:
                            enabled: false
                            mutual:
                              spire:
                                enabled: false
                                install:
                                  server:
                                    dataStorage:
                                      storageClass: cilium-spire-sc
                          
                  - name: cilium-bootstrap
                    contents: |
                      ---
                      apiVersion: rbac.authorization.k8s.io/v1
                      kind: ClusterRoleBinding
                      metadata:
                        name: cilium-install
                      roleRef:
                        apiGroup: rbac.authorization.k8s.io
                        kind: ClusterRole
                        name: cluster-admin
                      subjects:
                        - kind: ServiceAccount
                          name: cilium-install
                          namespace: kube-system
                      ---
                      apiVersion: v1
                      kind: ServiceAccount
                      metadata:
                        name: cilium-install
                        namespace: kube-system
                      ---
                      apiVersion: batch/v1
                      kind: Job
                      metadata:
                        name: cilium-install
                        namespace: kube-system
                      spec:
                        backoffLimit: 10
                        template:
                          metadata:
                            labels:
                              app: cilium-install
                          spec:
                            restartPolicy: OnFailure
                            tolerations:
                              - operator: Exists
                              - effect: NoSchedule
                                operator: Exists
                              - effect: NoExecute
                                operator: Exists
                              - effect: PreferNoSchedule
                                operator: Exists
                              - key: node-role.kubernetes.io/control-plane
                                operator: Exists
                                effect: NoSchedule
                              - key: node-role.kubernetes.io/control-plane
                                operator: Exists
                                effect: NoExecute
                              - key: node-role.kubernetes.io/control-plane
                                operator: Exists
                                effect: PreferNoSchedule
                            affinity:
                              nodeAffinity:
                                requiredDuringSchedulingIgnoredDuringExecution:
                                  nodeSelectorTerms:
                                    - matchExpressions:
                                        - key: node-role.kubernetes.io/control-plane
                                          operator: Exists
                            serviceAccountName: cilium-install
                            hostNetwork: true
                            containers:
                              - name: cilium-install
                                image: quay.io/cilium/cilium-cli-ci:latest
                                env:
                                  - name: KUBERNETES_SERVICE_HOST
                                    valueFrom:
                                      fieldRef:
                                        apiVersion: v1
                                        fieldPath: status.podIP
                                  - name: KUBERNETES_SERVICE_PORT
                                    value: "6443"
                                volumeMounts:
                                  - name: values
                                    mountPath: /root/app/values.yaml
                                    subPath: values.yaml
                                command:
                                  - cilium
                                  - install
                                  - --version=v1.16.3 # renovate: github-releases=cilium/cilium
                                  - --set
                                  - kubeProxyReplacement=true
                                  - --values
                                  - values.yaml
                            volumes:
                              - name: values
                                configMap:
                                  name: cilium-values
            EOT,
        ]
        id                          = "machine_configuration_apply"
      ~ machine_configuration       = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.talos.talos_machine_configuration_apply.worker_config_apply[0] will be updated in-place
  ~ resource "talos_machine_configuration_apply" "worker_config_apply" {
      ~ config_patches              = [
          ~ <<-EOT
                machine:
                  network:
                    hostname: talos-worker-01
              -     nameservers:
              -       - 1.1.1.1
              -       - 8.8.8.8
                  kubelet:
                    extraArgs:
                      rotate-server-certificates: true
                  nodeLabels:
                    topology.kubernetes.io/region: cluster01
                    topology.kubernetes.io/zone: pve01
            EOT,
        ]
        id                          = "machine_configuration_apply"
      ~ machine_configuration       = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.traefik.proxmox_virtual_environment_download_file.latest_ubuntu_20_focal_lxc_img will be created
  + resource "proxmox_virtual_environment_download_file" "latest_ubuntu_20_focal_lxc_img" {
      + content_type        = "vztmpl"
      + datastore_id        = "local"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "pve01"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "http://download.proxmox.com/images/system/ubuntu-20.04-standard_20.04-1_amd64.tar.gz"
      + verify              = true
    }

Plan: 4 to add, 3 to change, 0 to destroy.

Warning: The file does not exist in datastore and resource must be recreated.

  with module.proxmox.proxmox_virtual_environment_download_file.talos_nocloud_image,
  on modules/proxmox/files.tf line 3, in resource "proxmox_virtual_environment_download_file" "talos_nocloud_image":
   3: resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {

unexpected error when listing datastore files: error listing files from
datastore local: received an HTTP 403 response - Reason: Permission check
failed (/storage/local, Datastore.Audit|Datastore.AllocateSpace)

(and one more similar warning elsewhere)

```
*Triggered by @ravilushqa*